app/Themes/RentIt/Http/Controllers/PageController.php

select * from `pages` where `alias` = 'contact-us' and `pages`.`deleted_at` is null limit 1
---
	public function show( $slug ) {


		$page = \Corp\Page::where( 'alias', $slug )->first();