app/Themes/RentIt/Http/Controllers/ProductsController.php

    public function show($alias)
    {


        //
        $product = Product::with('translations', 'meta')->where('alias', $alias)->first();

        $this->title = getControllerTitle($product->title);
        $this->keywords = ($product->keywords);
        $this->description = ($product->meta_desc);


        $this->product_id = $product->id;
        $this->bookingDate($product->id);

        $gallery_media = $product->meta()->where('name', 'gallery_media')->select('value')->first();
        if ($gallery_media->value ?? false) {
            $gallery_media = explode(',', $gallery_media->value);
        }


        // get product meta and convert it to key value

        $product_meta = getProductMetas($product);


        $locations = Location::with('translations')->get();
---
select * from `ec_products` where `alias` = 'toyotayaris' and `ec_products`.`deleted_at` is null limit 1
select * from `ec_locations`

    public function bookingDate($id)
    {

        $arrayOfDates = [];
        $rentit_obj = $this->baseCms->getLocalizedFrontendJs('rentit-main', 'rentit_obj');


        $bookings = Booking::where('product_id', $id)->get();

        $arrayOfDates = [];

        //dump($bookings);

        foreach ($bookings as $booking) {


            if (isset($booking->order->status) && $booking->order->status == 'canceled') {
---
select * from `ec_bookings` where `product_id` = 39
select * from `ec_orders` where `ec_orders`.`id` is null limit 1