app/Plugins/eCommerce/Repositories/OrderRepository.php

	public function totalPrice( $request ) {


		$price = 0;
		$names = [];

		$product = Product::where( 'id', $request->product_id )->first();
---
select * from `ec_products` where `id` = '39' and `ec_products`.`deleted_at` is null limit 1